wiki/2016-06-17-jdk-webservice.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>jdk webservice</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">jdk webservice</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#java"><div class="category">java</div></a> </div>
<div class="char-counter">2016-06-17</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdd403f6">开发过程如下：</a></li>
<li><a href="#orgf363a04">发布webservice。如下</a></li>
<li><a href="#org5aa0122">在你的客户端位置键入命令：</a></li>
<li><a href="#org17b7e0d">调用方式如下：</a></li>
<li><a href="#orga8de064">注意的地方：</a></li>
<li><a href="#org5ee40a3">资料 JDK1.6 中自带了 webservice 的功能</a></li>
<li><a href="#org63cb01e">下面我们开始构建：</a></li>
<li><a href="#org7563588">代码</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgdd403f6" class="outline-2">
<h2 id="orgdd403f6">开发过程如下：</h2>
<div class="outline-text-2" id="text-orgdd403f6">
<ol class="org-ol">
<li>保证使用的是jdk6。</li>
<li><p>
编写开放出来的接口并实现，如下
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">public</span> <span style="font-weight: bold;">interface</span> <span style="font-weight: bold; text-decoration: underline;">UserService</span> {
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold;">saveUser</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">username</span>,<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">password</span>);
}

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">WebService</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">soap</span>.<span style="font-weight: bold; text-decoration: underline;">SOAPBinding</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">sql</span>.<span style="font-weight: bold; text-decoration: underline;">DataSource</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">springframework</span>.<span style="font-weight: bold; text-decoration: underline;">jdbc</span>.<span style="font-weight: bold; text-decoration: underline;">core</span>.<span style="font-weight: bold; text-decoration: underline;">simple</span>.<span style="font-weight: bold; text-decoration: underline;">SimpleJdbcTemplate</span>;

<span style="font-weight: bold; text-decoration: underline;">@WebService</span>(name = <span style="font-style: italic;">"UserService"</span>, serviceName = <span style="font-style: italic;">"UserService"</span>, targetNamespace = <span style="font-style: italic;">"http://cas.webservice.user/client"</span>)
<span style="font-weight: bold; text-decoration: underline;">@SOAPBinding</span>(style = <span style="font-weight: bold; text-decoration: underline;">SOAPBinding</span>.<span style="font-weight: bold; text-decoration: underline;">Style</span>.RPC)
<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">UserServiceImpl</span> <span style="font-weight: bold;">implements</span> <span style="font-weight: bold; text-decoration: underline;">UserService</span> {

    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">DataSource</span> <span style="font-weight: bold; font-style: italic;">dataSource</span>;

    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">SimpleJdbcTemplate</span> <span style="font-weight: bold; font-style: italic;">jdbcTemplate</span>;

    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">UserServiceImpl</span>() {

    }

    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">UserServiceImpl</span>(<span style="font-weight: bold; text-decoration: underline;">DataSource</span> <span style="font-weight: bold; font-style: italic;">dataSource</span>) {
        <span style="font-weight: bold;">this</span>.dataSource = dataSource;
        <span style="font-weight: bold;">this</span>.jdbcTemplate = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">SimpleJdbcTemplate</span>(dataSource);
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold;">saveUser</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">username</span>, <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">password</span>) {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">count</span> = jdbcTemplate.update(
            <span style="font-style: italic;">"insert  userinfo(userName,password) values(?,?)"</span>, username,
            password);

        <span style="font-weight: bold;">return</span> username + <span style="font-style: italic;">" : "</span> + password;
    }

}
</pre>
</div></li>
</ol>
</div>
</div>


<div id="outline-container-orgf363a04" class="outline-2">
<h2 id="orgf363a04">发布webservice。如下</h2>
<div class="outline-text-2" id="text-orgf363a04">
<pre class="example">
Endpoint.publish("http://127.0.0.1:9527/UserService",  ctx.getBean("wsUserService"));

</pre>
<p>
注：这里假如不用spring的话 直接new UserServiceImpl()。
</p>
</div>
</div>

<div id="outline-container-org5aa0122" class="outline-2">
<h2 id="org5aa0122">在你的客户端位置键入命令：</h2>
<div class="outline-text-2" id="text-org5aa0122">
<pre class="example">
wsimport -keep http://127.0.0.1:9527/UserService?wsdl

</pre>

<p>
此时会在此目录生成 cas/webservice/user/client/ 此文件夹，里面生成了你需要的客户
端调用类 UserService, UserService_Service。
</p>
</div>
</div>

<div id="outline-container-org17b7e0d" class="outline-2">
<h2 id="org17b7e0d">调用方式如下：</h2>
<div class="outline-text-2" id="text-org17b7e0d">
<pre class="example">
UserService_Service userService=new UserService_Service();
UserService user=userService.getUserServicePort();
System.out.println(user.saveUser("afei2","yes ido"));

</pre>
</div>
</div>

<div id="outline-container-orga8de064" class="outline-2">
<h2 id="orga8de064">注意的地方：</h2>
<div class="outline-text-2" id="text-orga8de064">
<ol class="org-ol">
<li>在发布的类(userServiceImpl)中假如带有接口属性，并且有其getter/setter，那么发
布会失败。</li>
<li>发布的ip假如是127.0.0.1的话localhost是不能访问的，是多少就是多少，不过实际项
目也不会这样的。</li>
<li>有的客户端调用的时候也会报错，比如Provider com.sun.xml.ws.spi.ProviderImpl
not found这个异常，我跟踪代码进去，发觉报错的那个jdk版本的Provider和我成功的
jdk版本是不一样的，在网上搜无答案，直说缺包，我感觉是个小bug。其他的没什么问
题。</li>
<li>因为这里没用任何webservice框架，没有把它嵌入tomcat（假如你需要在tomcat环境中），
所以端口另开，不能是8080。</li>
</ol>
</div>
</div>



<div id="outline-container-org5ee40a3" class="outline-2">
<h2 id="org5ee40a3">资料 JDK1.6 中自带了 webservice 的功能</h2>
<div class="outline-text-2" id="text-org5ee40a3">
<p>
因为集成了JAX-WS，这非常方便，不用再用第三方包来开发了。
</p>
</div>
</div>

<div id="outline-container-org63cb01e" class="outline-2">
<h2 id="org63cb01e">下面我们开始构建：</h2>
<div class="outline-text-2" id="text-org63cb01e">
<ol class="org-ol">
<li>先用Eclipse建立一个动态网站，注意需要生成web.xml，建工程的时候不要忘记勾选；</li>
<li>建立类实现Web Services接口，下面是一个简单定义Web Services接口的实现类：</li>
</ol>
</div>
</div>

<div id="outline-container-org7563588" class="outline-2">
<h2 id="org7563588">代码</h2>
<div class="outline-text-2" id="text-org7563588">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">package</span> <span style="font-weight: bold; text-decoration: underline;">javaWebServiceTest</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">WebMethod</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">WebParam</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">WebResult</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">WebService</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">WebParam</span>.<span style="font-weight: bold; text-decoration: underline;">Mode</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">soap</span>.<span style="font-weight: bold; text-decoration: underline;">SOAPBinding</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">soap</span>.<span style="font-weight: bold; text-decoration: underline;">SOAPBinding</span>.<span style="font-weight: bold; text-decoration: underline;">Style</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">javax</span>.<span style="font-weight: bold; text-decoration: underline;">jws</span>.<span style="font-weight: bold; text-decoration: underline;">soap</span>.<span style="font-weight: bold; text-decoration: underline;">SOAPBinding</span>.<span style="font-weight: bold; text-decoration: underline;">Use</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">webServiceInterface</span>.<span style="font-weight: bold; text-decoration: underline;">Person</span>;

<span style="font-weight: bold; text-decoration: underline;">@WebService</span>(name=<span style="font-style: italic;">"SayHello"</span>, portName=<span style="font-style: italic;">"SayHellowServicePort"</span>, serviceName=<span style="font-style: italic;">"SayHelloServiceName"</span>, targetNamespace=<span style="font-style: italic;">"http://www.webservice.com"</span>)
<span style="font-weight: bold; text-decoration: underline;">@SOAPBinding</span>(style = <span style="font-weight: bold; text-decoration: underline;">Style</span>.RPC,use = <span style="font-weight: bold; text-decoration: underline;">Use</span>.LITERAL)
<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">ChService</span> {

    <span style="font-weight: bold; text-decoration: underline;">@WebMethod</span>(action=<span style="font-style: italic;">"sayHello"</span>, operationName=<span style="font-style: italic;">"saySomeWord"</span>)
    <span style="font-weight: bold; text-decoration: underline;">@WebResult</span>(name=<span style="font-style: italic;">"Person"</span>, partName=<span style="font-style: italic;">"PersonName"</span>)
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">Person</span> <span style="font-weight: bold;">sayHelloWord</span>(<span style="font-weight: bold; text-decoration: underline;">@WebParam</span>(name=<span style="font-style: italic;">"paramA"</span>, partName=<span style="font-style: italic;">"p1"</span>, mode = <span style="font-weight: bold; text-decoration: underline;">Mode</span>.IN)<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">name</span>){
        <span style="font-weight: bold; text-decoration: underline;">Person</span> <span style="font-weight: bold; font-style: italic;">persons</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Person</span>();
        persons.setName(<span style="font-style: italic;">"My name is "</span> +name);
        <span style="font-weight: bold;">return</span> persons;
    }

}

<span style="font-weight: bold; font-style: italic;">//    </span><span style="font-weight: bold; font-style: italic;">Person&#31867;</span>
<span style="font-weight: bold;">package</span> <span style="font-weight: bold; text-decoration: underline;">webServiceInterface</span>;


<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Person</span>
{
    <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">name</span>;

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold;">getName</span>() {
        <span style="font-weight: bold;">return</span> name;
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">setName</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">name</span>) {
        <span style="font-weight: bold;">this</span>.name = name;
    }
}

</pre>
</div>

<p>
这样，我们基本上就实现了 webservice 的构建，是不是感觉不是很难，跟写普通的java方
法一样，其实 jdk 自带的 webservice 是通过注释注入方法实现的。所以上面那些以"@"符
号开头的都是非常重要的，也是必须的。
</p>

<p>
下面我们来配置我们写的WebService到Apache中：
</p>

<p>
上面第一步，我们生成了一个 web.xml 类，我们向 &lt;web-app&gt; 节点里面加入以下内容：
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="font-weight: bold;">listener</span>&gt;
       &lt;<span style="font-weight: bold;">listener-class</span>&gt;
               com.sun.xml.ws.transport.http.servlet.WSServletContextListener
       &lt;/<span style="font-weight: bold;">listener-class</span>&gt;
   &lt;/<span style="font-weight: bold;">listener</span>&gt;

   &lt;<span style="font-weight: bold;">servlet</span>&gt;
       &lt;<span style="font-weight: bold;">servlet-name</span>&gt;TestService&lt;/<span style="font-weight: bold;">servlet-name</span>&gt;
       &lt;<span style="font-weight: bold;">servlet-class</span>&gt;
           com.sun.xml.ws.transport.http.servlet.WSServlet
       &lt;/<span style="font-weight: bold;">servlet-class</span>&gt;
   &lt;/<span style="font-weight: bold;">servlet</span>&gt;

   &lt;<span style="font-weight: bold;">servlet-mapping</span>&gt;
       &lt;<span style="font-weight: bold;">servlet-name</span>&gt;TestService&lt;/<span style="font-weight: bold;">servlet-name</span>&gt;
       &lt;<span style="font-weight: bold;">url-pattern</span>&gt;/jdkService&lt;/<span style="font-weight: bold;">url-pattern</span>&gt;
   &lt;/<span style="font-weight: bold;">servlet-mapping</span>&gt;
</pre>
</div>


<p>
在 web.xml 的目录中再建立一个 sun-jaxws.xml 来配置 endpoint 的相关内容。
</p>
<div class="org-src-container">
<pre class="src src-xml"><span style="font-style: italic;">&lt;?</span><span style="font-weight: bold; font-style: italic;">xml</span><span style="font-style: italic;"> </span><span style="font-style: italic;">version="1.0" encoding="UTF-8"</span><span style="font-style: italic;">?&gt;</span>
   &lt;<span style="font-weight: bold;">endpoints</span> <span style="font-weight: bold;">xmlns</span>='http://java.sun.com/xml/ns/jax-ws/ri/runtime' <span style="font-weight: bold; font-style: italic;">version</span>='2.0'&gt;
       &lt;<span style="font-weight: bold;">endpoint</span>
       <span style="font-weight: bold; font-style: italic;">name</span>='TestService'
       <span style="font-weight: bold; font-style: italic;">implementation</span>='javaWebServiceTest.ChService'
       <span style="font-weight: bold; font-style: italic;">binding</span>=<span style="font-style: italic;">"http://java.sun.com/xml/ns/jaxws/2003/05/soap/bindings/HTTP/"</span>
       <span style="font-weight: bold; font-style: italic;">url-pattern</span>='/jdkService'/&gt;
   &lt;/<span style="font-weight: bold;">endpoints</span>&gt;

</pre>
</div>


<p>
好了，配置完了。把我们建立的项目加入到apache7.0中，然后启动。
</p>

<p>
在浏览器输入:<a href="http://localhost:8080/TestWebService/jdkService?wsdl,%E4%BE%BF%E5%8F%AF">http://localhost:8080/TestWebService/jdkService?wsdl,便可</a>
以访问到。
</p>

<p>
如图：
</p>

<p>
现在我们来说说那些以"@"符号开头的内容。
</p>

<ol class="org-ol">
<li><p>
@WebService(name="SayHello", portName="SayHellowServicePort",  serviceName="SayHelloServiceName", targetNamespace="<a href="http://www.possystem.com">http://www.possystem.com</a>")
</p>
<p class="verse">
name: SayHello<br>
用户实例化用,例：<br>
private WinService.SayHelloClient win = new winformService.WinService.SayHelloClient();<br>
WSDL中：&lt;portType name="SayHello"&gt;<br>
<br>
serviceName: SayHelloServiceName<br>
指定Web Service的名称 ，<br>
WSDL中：&lt;service name="SayHelloServiceName"&gt;<br>
<br>
portName: SayHellowServicePort<br>
WSDL中：&lt;port name="SayHellowServicePort" binding="tns:SayHellowServicePortBinding"&gt;<br>
<br>
wsdlLocation：wsdlLocation 是引用预先存在的 WSDL 文件的 URL（相对或绝对）。<br>
targetNamespace：wsdl命名空间<br>
<br>
<br>
</p></li>

<li><p>
@SOAPBinding(style = Style.RPC,use = Use.LITERAL)
</p>
<p class="verse">
style: 定义发送到 Web Service 的消息和从 Web Service 发送的消息的编码样式。<br>
Document和RPC两种形式<br>
默认值： javax.jws.soap.SOAPBinding.Style.DOCUMENT<br>
<br>
use: 定义发送到 Web Service 的消息和从 Web Service 发送的消息的格式样式。<br>
ENCODED和 LITERAL两种形式<br>
默认值： javax.jws.soap.SOAPBinding.Use.LITERAL<br>
<br>
</p></li>

<li><p>
@WebMethod(action="sayHello", operationName="saySomeWord")
</p>
<p class="verse">
action: sayHello<br>
此操作的动作。 对于 SOAP 绑定，此方法可确定 soap 动作的值。<br>
WSDL中： &lt;soap12:operation soapAction="sayHello" /&gt;<br>
<br>
operationName： sayHelloWord1<br>
与此方法匹配的 wsdl:operation 的名称。<br>
此名称也用于客户端调用的方法的名称。<br>
<br>
exclude: 将某一方法标记为不作为一个 web 方法公开。<br>
<br>
</p></li>

<li><p>
@WebResult(name="Person", partName="PersonName")
</p>
<p class="verse">
name: Person<br>
返回值的名称。 如果操作是 rpc 样式，并且partName尚未指定, 表示此返回值的 wsdl:part 的名称<br>
WSDL中：&lt;part name="Person" type="tns:person" /&gt;<br>
<br>
partName： PersonName<br>
表示此返回值的 wsdl:part 的名称。<br>
此名称只在操作是 rpc 样式，或者操作是文档样式且参数样式为 BARE 时使用。<br>
WSDL中：&lt;part name="PersonName" type="tns:person" /&gt;<br>
<br>
</p></li>

<li><p>
public Person sayHelloWord(@WebParam(name="paramA", partName="p1", mode = Mode.IN)String name){……}
</p>
<p class="verse">
name: paramA<br>
如果该操作是 rpc 样式的，并且尚未指定 @WebParam.partName，则此名称是表示参数的 wsdl:part 的名称。<br>
如果该操作是文档样式的，或者参数映射到某一个头，则此名称是表示参数的 XML 元素的本地名称。<br>
如果操作是文档样式的，参数样式为 BARE 并且模式为 OUT 或 INOUT，则必须指定一个名称。<br>
客户端调用时参数名称显示该值。<br>
<br>
partName： p1<br>
表示此参数的 wsdl:part 的名称。<br>
此名称仅在操作是 rpc 样式，或者操作是文档样式且参数样式为 BARE 时使用。<br>
WSDL中：<br>
&lt;message name="sayHelloWord1"&gt;<br>
&#xa0;&#xa0;&lt;part name="p1" type="xsd:string" /&gt;<br>
&lt;/message&gt;<br>
客户端调用时参数名称显示该值。<br>
这个主要是根据样式来。<br>
<br>
mode：参数的流向（IN、OUT 或 INOUT 之一）。<br>
<br>
</p></li>
</ol>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
